Repository: Faizanahmedsy/super-school
Catalog: super-school-backend/LMS-python/report_app/locale/*/LC_MESSAGES/django.po
Languages: is

source: You do not have permission to generate reports.
is: Awunayo imvume yokukhiqiza imibiko.

source: Invalid year format. Please provide a valid year.
is: Ifomethi yonyaka ayivumelekile. Ngiyacela unikeze unyaka ovumelekile.

source: Error processing data for school %(school_name)s: %(error)s
is: Iphutha ekucubunguleni imininingwane yesikole %(school_name)s: %(error)s

source: School ID is required for users with SUPER_ROLE.
is: I-ID yesikole iyadingeka kubasebenzisi abane-SUPER_ROLE.

source: School ID is required.
is: I-ID yesikole iyadingeka.

source: Invalid batch_id format. It must be an integer.
is: Ifomethi ye-batch_id ayivumelekile. Kumele kube yinombolo ephelele.

source: Invalid subject_id format. It must be an integer.
is: Ifomethi ye-subject_id ayivumelekile. Kumele kube yinombolo ephelele.

source: School ID is required for SUPER_ROLE users.
is: I-ID yesikole iyadingeka kubasebenzisi be-SUPER_ROLE.

source: Batch ID is required.
is: I-Batch ID iyadingeka.

source: School not found.
is: Isikole asitholakalanga.

source: An error occurred: %(error)s
is: Kuvele iphutha: %(error)s
