Repository: Faizanahmedsy/super-school
Catalog: super-school-backend/LMS-python/digital_marking/locale/*/LC_MESSAGES/django.po
Languages: af, is

source: school_id is required.
af: school_id is vereis.
is: i-ID yesikole iyadingeka.

source: Assessment subject ID is required.
af: Assesseringvak-ID is vereis.
is: i-ID yesihloko sokuhlolwa iyadingeka.

source: Grade class ID is required.
af: Graadklas-ID is vereis.
is: i-ID yekilasi leBanga iyadingeka.

source: student_id is required.
af: student_id is vereis.
is: i-ID yomfundi iyadingeka.

source: No subjects found for this teacher
af: Geen vakke gevind vir hierdie onderwyser nie.
is: Azikho izihloko ezitholakele zalomfundisi.

source: Please provide answer_sheet
af: Verskaf asseblief 'n antwoordblad.
is: Sicela unikeze ifayela lemibuzo ephenduliwe.

source: Assessment subject not found
af: Assesseringvak nie gevind nie.
is: Isihloko sokuhlolwa asitholakalanga.

source: Uploading answer sheet for this assessment is locked
af: Oplaai van antwoordblad vir hierdie assessering is gesluit.
is: Ukulayisha ifayela lemibuzo ephenduliwe kulokhu kuhlolwa kuvaliwe.

source: You do not have permission to upload answersheet
af: Jy het nie toestemming om 'n antwoordblad op te laai nie.
is: Awunayo imvume yokulayisha ifayela lemibuzo ephenduliwe.

source: Unsupported file type
af: Nie-ondersteunde lêertipe.
is: Uhlobo lwefayela alusekelwe.

source: The student with QR Code ID %(qr_code)s is not registered for this examination.
af: Die student met QR-kode-ID %(qr_code)s is nie vir hierdie eksamen geregistreer nie.
is: Umfundi one-ID ye-QR Code %(qr_code)s akabhalisiwe kulokhu kuhlolwa.

source: Bulk PDF has been uploaded successfully.
af: Die grootmaat PDF is suksesvol opgelaai.
is: I-PDF enkulu ilayishwe ngempumelelo.

source: Answer sheet uploaded successfully
af: Antwoordblad suksesvol opgelaai.
is: Ishidi lempendulo lilayishwe ngempumelelo.

source: You do not have permission to delete answersheet
af: Jy het nie toestemming om die antwoordblad uit te vee nie.
is: Awunayo imvume yokususa ifayela lemibuzo ephenduliwe.

source: unable to delete file
af: Kan nie lêer uitvee nie.
is: Ayikwazi ukususa ifayela.

source: Answer sheet deleted successfully
af: Antwoordblad nie gevind nie.
is: Ifayela lemibuzo ephenduliwe alitholakalanga.

source: Answer sheet not found
af: Antwoordblad nie gevind nie.
is: Ifayela lemibuzo ephenduliwe alitholakalanga.

source: Update method is disabled.
af: Opdateermetode is gedeaktiveer.
is: Indlela yokuvuselela ivaliwe.

source: Partial update is disabled.
af: Gedeeltelike opdatering is gedeaktiveer.
is: Ukuvuselela okuyingxenye kuvuliwe.

source: Automate marking is already in progress
af: Geoutomatiseerde merk is reeds aan die gang.
is: Uhlelo lokuzenzakalela kokumaka seluyaqhubeka.

source: Automate marking has been started
af: Geoutomatiseerde merk is reeds aan die gang.
is: Uhlelo lokuzenzakalela kokumaka seluyaqhubeka.

source: Please provide student_answer_sheet_id
af: Verskaf asseblief student_answer_sheet_id.
is: Sicela unikeze i-ID yefayela lemibuzo ephenduliwe yomfundi.

source: Student answer sheet not found
af: Student se antwoordblad nie gevind nie.
is: Ifayela lemibuzo ephenduliwe lomfundi alitholakalanga.

source: Answer sheet has been reviewed
af: Geen antwoordblad-ID is verskaf nie.
is: Akukho i-ID yefayela lemibuzo ephenduliwe enikeziwe.

source: You do not have permission to view this endpoint.
af: Jy het nie toestemming om hierdie eindpunt te besigtig nie.
is: Awunayo imvume yokubuka leli phuzu lokugcina.

source: No school associated with the logged-in user.
af: Geen skool geassosieer met die aangemelde gebruiker nie.
is: Akukho sikole esihambisana nomsebenzisi ongene ngemvume.

source: No assessments match the applied filters.
af: Geen assesserings stem ooreen met die toegepaste filters nie.
is: Akukho kuhlolwa okuhambisana nezihlungi ezisetshenzisiwe.

source: No assessments match the applied filters or search query.
af: Geen assesserings stem ooreen met die toegepaste filters of soeknavraag nie.
is: Akukho kuhlolwa okuhambisana nezihlungi ezisetshenzisiwe noma umbuzo wokusesha.

source: No answersheet id was provided.
af: Geen antwoordblad-ID is verskaf nie.
is: Akukho i-ID yefayela lemibuzo ephenduliwe enikeziwe.

source: Answer sheet not found.
af: Antwoordblad nie gevind nie.
is: Ifayela lemibuzo ephenduliwe alitholakalanga.
