Repository: Faizanahmedsy/super-school
Catalog: super-school-backend/LMS-python/exam_app/locale/*/LC_MESSAGES/django.po
Languages: af, is

source: The '%(missing_field)s' field is required.
af: Die '%(missing_field)s' veld is vereis.
is: Insimu '%(missing_field)s' iyadingeka.

source: Assessment start datetime must be before assessment end datetime.
af: Die begin-datum en -tyd van die assessering moet voor die eind-datum en -tyd wees.
is: Usuku nesiqalo sokuhlola kumele kube ngaphambi kosuku nesiqalo sokuphela kokuhlola.

source: Invalid datetime format. Use ISO 8601 format.
af: Ongeldige datum- en tydformaat. Gebruik die ISO 8601-formaat.
is: Ifomethi yesikhathi yosuku ayivumelekile. Sebenzisa ifomethi ye-ISO 8601.

source: No class subjects found for the given grade, batch, and term.
af: Geen klasvakke gevind vir die gegewe graad, groep en termyn nie.
is: Azikho izifundo ezitholakalayo kuleli banga, iqoqo, nesikhathi esishiwo.

source: No teacher is assigned to any class for the given criteria.
af: Geen onderwyser is aan enige klas toegewys vir die gegewe kriteria nie.
is: Akukho thisha owabelwe noma yiliphi ikilasi ngezilinganiso ezishiwo.

source: No students are assigned to any class for the given criteria.
af: Geen studente is aan enige klas toegewys vir die gegewe kriteria nie.
is: Akekho umfundi obelwe noma yiliphi ikilasi ngezilinganiso ezishiwo.

source: Invalid data for grade, batch, or term.
af: Ongeldige data vir graad, groep of termyn.
is: Idatha engavumelekile yebanga, iqoqo, noma isikhathi.

source: You do not have permission to create assessments for this class as current batch.
af: Jy het nie toestemming om assesserings vir hierdie klas as die huidige groep te skep nie.
is: Awunayo imvume yokudala ukuhlolwa kwaleli kilasi njengeqoqo lamanje.

source: The %(field)s field: %(message)s
af: Die %(field)s veld: %(message)s
is: Insimu ye-%(field)s: %(message)s

source: Invalid subject ID provided.
af: Ongeldige vak-ID verskaf.
is: I-ID yezifundo enikeziwe ayivumelekile.

source: Invalid grade class IDs provided: %(invalid_ids)s
af: Ongeldige graad-klas-IDs verskaf: %(invalid_ids)s
is: Ama-ID ebanga lekilasi angavumelekile anikeziwe: %(invalid_ids)s

source: No teacher is assigned to the provided grade, batch, and subject.
af: Geen onderwyser is aan die verskafde graad, groep en vak toegewys nie.
is: Akukho thisha obelwe ibanga, iqoqo, nesifundo esishiwo.

source: No students are assigned to the provided grade, batch, and subject.
af: Geen studente is aan die verskafde graad, groep en vak toegewys nie.
is: Akekho abafundi ababelwe ibanga, iqoqo, nesifundo esishiwo.

source: Assessment subjects created successfully.
af: Assesseringvakke suksesvol geskep.
is: Izifundo zokuhlolwa zidalwe ngempumelelo.

source: Teacher record not found.
af: Onderwyserrekord nie gevind nie.
is: Irekhodi lothisha alitholakalanga.

source: Invalid assessment or datetime format.
af: Ongeldige assessering of datum- en tydformaat.
is: Ifomethi yokuhlolwa noma yesikhathi yosuku ayivumelekile.

source: Unauthorized: Teacher does not teach the provided class or subject.
af: Ongemagtig: Die onderwyser onderrig nie die verskafde klas of vak nie.
is: Ayigunyaziwe: Uthisha akafundisi ikilasi noma isifundo esishiwo.

source: Invalid assessment ID.
af: Ongeldige assesserings-ID.
is: I-ID yokuhlolwa ayivumelekile.

source: The assessment start date must be on or before the earliest associated AssessmentSubject start date.
af: Die begin-datum van die assessering moet op of voor die vroegste verwante AssesseringVak-begin-datum wees.
is: Usuku loku qala ukuhlolwa kumele lube ngosuku noma ngaphambi kosuku lokuqala lwe-AssessmentSubject ehlobene.

source: Assessment end date must be later than or equal to the latest associated AssessmentSubject end date.
af: Die eind-datum van die assessering moet later of gelyk wees aan die mees onlangse verwante AssesseringVak-eind-datum.
is: Usuku lokuphela kokuhlolwa kumele lube kamuva kunosuku lokugcina lwe-AssessmentSubject ehlobene.

source: Invalid datetime format: %(datetime)s
af: Ongeldige datum- en tydformaat: %(datetime)s
is: Ifomethi yesikhathi yosuku engavumelekile: %(datetime)s

source: School ID is required.
af: Skool-ID is vereis.
is: I-ID yesikole iyadingeka.

source: Missing required fields: %(fields)s
af: Vereiste velde ontbreek: %(fields)s
is: Izinsimu ezidingekayo azikho: %(fields)s

source: You do not have permission to create assessments.
af: Jy het nie toestemming om assesserings te skep nie.
is: Awunayo imvume yokudala ukuhlolwa.

source: Assessment created successfully
af: Assessering suksesvol gekanselleer.
is: Ukuhlolwa kukhanseliwe ngempumelelo.

source: Role not recognized.
af: Rol nie herken nie.
is: Indima ayaziwa.

source: No data found.
af: Geen data gevind nie.
is: Ayikho idatha etholakele.

source: You are not authorized to update this assessment.
af: Jy is nie gemagtig om hierdie assessering op te dateer nie.
is: Awunagunyaziwe ukuvuselela lokhu kuhlolwa.

source: You do not have access to this assessment.
af: Jy het nie toegang tot hierdie assessering nie.
is: Awunayo imvume yokufinyelela lokhu kuhlolwa.

source: You do not belong to this school.
af: Jy behoort nie aan hierdie skool nie.
is: Awuhlali kuleli sikole.

source: Assessment updated successfully
af: Assessering suksesvol gekanselleer.
is: Ukuhlolwa kukhanseliwe ngempumelelo.

source: Cannot cancel a cancelled assessment.
af: Kan nie 'n reeds gekanselleerde assessering kanselleer nie.
is: Ayikwazi ukukhansela ukuhlolwa esekhanselewe.

source: Unauthorized role.
af: Ongemagtigde rol.
is: Indima engagunyaziwe.

source: Both `assessment_subject_id` and `memo` are required.
af: Beide `assessment_subject_id` en `memo` is vereis.
is: Kudingeka kokubili `assessment_subject_id` kanye ne-`memo`.

source: AssessmentSubject with id %(id)s does not exist or is not in your school.
af: AssessmentSubject met ID %(id)s bestaan nie of is nie in jou skool nie.
is: I-AssessmentSubject ene-ID %(id)s ayikho noma ayitholakali esikoleni sakho.

source: Memo updated successfully.
af: Memo suksesvol opgedateer.
is: Imemo ivuselelwe ngempumelelo.

source: Both `assessment_subject_id` and `question_paper` are required.
af: Beide `assessment_subject_id` en `question_paper` is vereis.
is: Kudingeka kokubili `assessment_subject_id` kanye ne-`question_paper`.

source: Question Paper updated successfully.
af: Vraestel suksesvol opgedateer.
is: Iphepha lembuzo livuselelwe ngempumelelo.

source: Cannot cancel assessment.
af: Kan nie assessering kanselleer nie.
is: Ayikwazi ukukhansela ukuhlolwa.

source: Assessment cancelled successfully.
af: Assessering suksesvol gekanselleer.
is: Ukuhlolwa kukhanseliwe ngempumelelo.

source: assessment_subject_id is required
af: assessment_subject_id is vereis.
is: i-assessment_subject_id iyadingeka

source: No students found for this assessment subject
af: Geen studente gevind vir hierdie assesseringsvak nie.
is: Akukho abafundi abatholakele kule ndaba yokuhlolwa.

source: Cover paper downloaded successfully
af: Dekblad suksesvol afgelaai.
is: Iphepha lokuvikela ilayishwe ngempumelelo.

source: Cover paper deleted successfully
af: Dekblad suksesvol uitgevee.
is: Iphepha lokuvikela lisuswe ngempumelelo.

source: File not found in storage
af: LÃªer nie in berging gevind nie.
is: Ifayela alitholakali endaweni yokugcina.

source: Error deleting cover paper: %(error)s
af: Fout met die uitvee van dekblad: %(error)s
is: Iphutha ekusulweni kwephepha lokuvikela: %(error)s
