Repository: Faizanahmedsy/super-school
Catalog: super-school-backend/LMS-python/personalized_learning/locale/*/LC_MESSAGES/django.po
Languages: af, is

source: school_id is required.
af: school_id is vereis.
is: i-school_id iyadingeka.

source: You have already generated 40 quizzes for this Class and Subject. You cannot generate more.
af: Jy het reeds 40 vasvrae vir hierdie klas en vak gegenereer. Jy kan nie meer genereer nie.
is: Usuvele wakhiqiza imibuzo engama-40 yeliKlasi neSifundo. Awukwazi ukukhiqiza eminye.

source: Both quiz_start_date_time and quiz_end_date_time are required.
af: Beide quiz_start_date_time en quiz_end_date_time is vereis.
is: Zombili i-quiz_start_date_time ne-quiz_end_date_time ziyadingeka.

source: quiz_start_date_time must be earlier than quiz_end_date_time.
af: quiz_start_date_time moet vroeër wees as quiz_end_date_time.
is: i-quiz_start_date_time kumele ibe ngaphambi kwe-quiz_end_date_time.

source: Number of questions must be less than or equal to 25.
af: Die aantal vrae moet minder as of gelyk aan 25 wees.
is: Inani lemibuzo kumele libe ngaphansi noma lilingane nama-25.

source: Grade and subject are required.
af: Graad en vak is vereis.
is: Ibanga nesifundo kuyadingeka.

source: grade_class must be a non-empty list.
af: grade_class moet 'n nie-leë lys wees.
is: i-grade_class kumele ibe uhlu olungenalo lutho.

source: No exam result found,Try generating quiz after exam
af: Geen eksamenuitslae gevind nie. Probeer om die vasvra na die eksamen te genereer.
is: Akukatholakali imiphumela yokuhlolwa, Zama ukukhiqiza imibuzo ngemuva kokuhlolwa

source: Failed to generate quiz with AI. Please try again later.
af: Kon nie die vasvra met AI genereer nie. Probeer asseblief later weer.
is: Kuhlulekile ukukhiqiza imibuzo nge-AI. Sicela uzame futhi ngokuhamba kwesikhathi.

source: GradeClass with ID %(grade_class_id)s does not exist.
af: GradeClass met ID %(grade_class_id)s bestaan nie.
is: I-GradeClass ene-ID %(grade_class_id)s ayikho.

source: No students found for grade class %(grade_class_id)s.
af: Geen studente gevind vir graadklas %(grade_class_id)s nie.
is: Abafundi abatholakalanga be-grade class %(grade_class_id)s.

source: Quizzes created successfully for %(num_learners)s learners.
af: Vasvrae suksesvol geskep vir %(num_learners)s leerders.
is: Imibuzo idalwe ngempumelelo kubafundi abangu-%(num_learners)s.

source: You do not have permission to perform this action.
af: Jy het nie toestemming om hierdie aksie uit te voer nie.
is: Awunayo imvume yokwenza lesi senzo.

source: Term is required.
af: Termyn is vereis.
is: Itheminali iyadingeka.

source: You have already generated 25 quizzes for this TERM. You cannot generate more.
af: Jy het reeds 25 vasvrae vir hierdie termyn gegenereer. Jy kan nie meer genereer nie.
is: Usuvele wakhiqiza imibuzo engama-25 yale THEMINE. Awukwazi ukukhiqiza eminye.

source: grade_id required for generating quiz.
af: grade_id is vereis om 'n vasvra te genereer.
is: i-grade_id iyadingeka ukuze kukhiqizwe imibuzo.

source: subject_id is required.
af: subject_id is vereis.
is: i-subject_id iyadingeka.

source: weaknesses is required.
af: swakhede is vereis.
is: ubuthakathaka buyadingeka.

source: Quiz generated successfully
af: Vasvra suksesvol gegenereer.
is: Imibuzo ikhiqizwe ngempumelelo

source: Quizzes created successfully for %(count)d quizzes.
af: Vasvrae suksesvol geskep vir %(count)d vasvrae.
is: Imibuzo idalwe ngempumelelo yemibuzo engu-%(count)d.

source: MainQuiz with id %(pk)s does not exist.
af: MainQuiz met id %(pk)s bestaan nie.
is: I-MainQuiz ene-id %(pk)s ayikho.

source: Each QuizQandA object must include its 'id' for update.
af: Elke QuizQandA-objek moet sy 'id' insluit vir opdatering.
is: Into ngayinye ye-QuizQandA kumele ifake 'i-id' yayo ukuze ibuyekezwe.

source: QuizQandA with id %(qanda_id)s does not exist for the provided MainQuiz.
af: QuizQandA met id %(qanda_id)s bestaan nie vir die gegewe MainQuiz nie.
is: I-QuizQandA ene-id %(qanda_id)s ayikho kwi-MainQuiz enikeziwe.

source: Strengths and weaknesses retrieved successfully.
af: Sterkpunte en swakpunte suksesvol verkry.
is: Amandla nobuthakathaka kutholwe ngempumelelo.
